# ConnectionLibraryApi

| Method  | Description |
|--------|-------------|
| **GetDesignItemPictureAsync** | Retrieves the picture associated with the specified design item as a PNG image. |
| **GetDesignSetsAsync** | Retrieves a list of design sets available for the user. |
| **GetTemplateAsync** | Retrieves the template associated with the specified design set and design item. |
| **ProposeAsync** | Proposes a list of design items for a specified connection within a project. |
| **PublishConnectionAsync** | Publish template to Private or Company set. |

<a id="getdesignitempicture"></a>
## **GetDesignItemPictureAsync**
> **void GetDesignItemPictureAsync (Guid? designSetId = null, Guid? designItemId = null)**

Retrieves the picture associated with the specified design item as a PNG image.

This method is mapped to API version 2 and produces a PNG image. The image is returned as a file              stream result with the file name set to the design item's ID.

### Parameters

| Name | Type | Description | Notes |
|------|------|-------------|-------|
| **designSetId** | **Guid?** | The unique identifier of the design set. | [optional]  |
| **designItemId** | **Guid?** | The unique identifier of the design item for which the template is requested. | [optional]  |

### Return type

void (empty response body)

### Example

Note: this example is autogenerated.

```csharp
using System;
using System.Collections.Generic;
using System.Diagnostics;
using IdeaStatiCa.ConnectionApi.Api;
using IdeaStatiCa.ConnectionApi.Client;
using IdeaStatiCa.ConnectionApi.Model;

namespace Example
{
    public class GetDesignItemPictureAsyncExample
    {
        public static async Task Main()
        {
            string ideaConFile = "testCon.ideaCon";

            string ideaStatiCaPath = "C:\\Program Files\\IDEA StatiCa\\StatiCa 26.0"; // Path to the IdeaStatiCa.ConnectionRestApi.exe

            using (var clientFactory = new ConnectionApiServiceRunner(ideaStatiCaPath))
            {
                using (var conClient = await clientFactory.CreateApiClient())
                {

                    // (Required) Select parameters

                    try
                    {
                        // Retrieves the picture associated with the specified design item as a PNG image.
                        conClient.ConnectionLibrary.GetDesignItemPictureAsync(designSetId, designItemId);
                    }
                    catch (ApiException  e)
                    {
                        Console.WriteLine("Exception when calling ConnectionLibrary.GetDesignItemPictureAsync: " + e.Message);
                        Console.WriteLine("Status Code: " + e.ErrorCode);
                        Console.WriteLine(e.StackTrace);
                    }
                    finally
                    {
                    }
                }
            }
        }
    }
}
```

### Code Samples

[!code-csharp]

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **GET** /api/5/connection-library/get-picture

#### Using the GetDesignItemPictureWithHttpInfo variant
This returns an ApiResponse object which contains the response data, status code and headers.

```csharp
try
{
    // Retrieves the picture associated with the specified design item as a PNG image.
    conClient.ConnectionLibrary.GetDesignItemPictureWithHttpInfo(designSetId, designItemId);
}
catch (ApiException e)
{
    Debug.Print("Exception when calling ConnectionLibraryApi.GetDesignItemPictureWithHttpInfo: " + e.Message);
    Debug.Print("Status Code: " + e.ErrorCode);
    Debug.Print(e.StackTrace);
}
```

#### Authorization

No authorization required

#### HTTP request headers

 - **Content-Type**: Not defined
 - **Accept**: image/png

#### HTTP response details
| Status code | Description | Response headers |
|-------------|-------------|------------------|
| **200** | OK |  -  |
| **401** | Unauthorized |  -  |
| **500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="getdesignsets"></a>
## **GetDesignSetsAsync**
> **List&lt;ConDesignSet&gt; GetDesignSetsAsync ()**

Retrieves a list of design sets available for the user.

This method returns a collection of design sets that are mapped and ready for use. It throws an              exception if no design sets are available for the user.

### Parameters
This endpoint does not need any parameter.
### Return type

**List&lt;ConDesignSet&gt;**

### Example

Note: this example is autogenerated.

```csharp
using System;
using System.Collections.Generic;
using System.Diagnostics;
using IdeaStatiCa.ConnectionApi.Api;
using IdeaStatiCa.ConnectionApi.Client;
using IdeaStatiCa.ConnectionApi.Model;

namespace Example
{
    public class GetDesignSetsAsyncExample
    {
        public static async Task Main()
        {
            string ideaConFile = "testCon.ideaCon";

            string ideaStatiCaPath = "C:\\Program Files\\IDEA StatiCa\\StatiCa 26.0"; // Path to the IdeaStatiCa.ConnectionRestApi.exe

            using (var clientFactory = new ConnectionApiServiceRunner(ideaStatiCaPath))
            {
                using (var conClient = await clientFactory.CreateApiClient())
                {

                    // (Required) Select parameters

                    try
                    {
                        // Retrieves a list of design sets available for the user.
                        List<ConDesignSet> result = await conClient.ConnectionLibrary.GetDesignSetsAsync();
                        Debug.WriteLine(result);
                    }
                    catch (ApiException  e)
                    {
                        Console.WriteLine("Exception when calling ConnectionLibrary.GetDesignSetsAsync: " + e.Message);
                        Console.WriteLine("Status Code: " + e.ErrorCode);
                        Console.WriteLine(e.StackTrace);
                    }
                    finally
                    {
                    }
                }
            }
        }
    }
}
```

### Code Samples

[!code-csharp]

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **GET** /api/5/connection-library/get-design-sets

#### Using the GetDesignSetsWithHttpInfo variant
This returns an ApiResponse object which contains the response data, status code and headers.

```csharp
try
{
    // Retrieves a list of design sets available for the user.
    ApiResponse<List<ConDesignSet>> response = conClient.ConnectionLibrary.GetDesignSetsWithHttpInfo();
    Debug.Write("Status Code: " + response.StatusCode);
    Debug.Write("Response Headers: " + response.Headers);
    Debug.Write("Response Body: " + response.Data);
}
catch (ApiException e)
{
    Debug.Print("Exception when calling ConnectionLibraryApi.GetDesignSetsWithHttpInfo: " + e.Message);
    Debug.Print("Status Code: " + e.ErrorCode);
    Debug.Print(e.StackTrace);
}
```

#### Authorization

No authorization required

#### HTTP request headers

 - **Content-Type**: Not defined
 - **Accept**: application/json

#### HTTP response details
| Status code | Description | Response headers |
|-------------|-------------|------------------|
| **200** | OK |  -  |
| **401** | Unauthorized |  -  |
| **500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="gettemplate"></a>
## **GetTemplateAsync**
> **string GetTemplateAsync (Guid? designSetId = null, Guid? designItemId = null)**

Retrieves the template associated with the specified design set and design item.

This method is mapped to API version 2 and produces a plain text response. It is intended to be              used in scenarios where the template of a design item needs to be retrieved for further processing or              display.

### Parameters

| Name | Type | Description | Notes |
|------|------|-------------|-------|
| **designSetId** | **Guid?** | The unique identifier of the design set. | [optional]  |
| **designItemId** | **Guid?** | The unique identifier of the design item for which the template is requested. | [optional]  |

### Return type

**string**

### Example

Note: this example is autogenerated.

```csharp
using System;
using System.Collections.Generic;
using System.Diagnostics;
using IdeaStatiCa.ConnectionApi.Api;
using IdeaStatiCa.ConnectionApi.Client;
using IdeaStatiCa.ConnectionApi.Model;

namespace Example
{
    public class GetTemplateAsyncExample
    {
        public static async Task Main()
        {
            string ideaConFile = "testCon.ideaCon";

            string ideaStatiCaPath = "C:\\Program Files\\IDEA StatiCa\\StatiCa 26.0"; // Path to the IdeaStatiCa.ConnectionRestApi.exe

            using (var clientFactory = new ConnectionApiServiceRunner(ideaStatiCaPath))
            {
                using (var conClient = await clientFactory.CreateApiClient())
                {

                    // (Required) Select parameters

                    try
                    {
                        // Retrieves the template associated with the specified design set and design item.
                        string result = await conClient.ConnectionLibrary.GetTemplateAsync(designSetId, designItemId);
                        Debug.WriteLine(result);
                    }
                    catch (ApiException  e)
                    {
                        Console.WriteLine("Exception when calling ConnectionLibrary.GetTemplateAsync: " + e.Message);
                        Console.WriteLine("Status Code: " + e.ErrorCode);
                        Console.WriteLine(e.StackTrace);
                    }
                    finally
                    {
                    }
                }
            }
        }
    }
}
```

### Code Samples

[!code-csharp]

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **GET** /api/5/connection-library/get-template

#### Using the GetTemplateWithHttpInfo variant
This returns an ApiResponse object which contains the response data, status code and headers.

```csharp
try
{
    // Retrieves the template associated with the specified design set and design item.
    ApiResponse<string> response = conClient.ConnectionLibrary.GetTemplateWithHttpInfo(designSetId, designItemId);
    Debug.Write("Status Code: " + response.StatusCode);
    Debug.Write("Response Headers: " + response.Headers);
    Debug.Write("Response Body: " + response.Data);
}
catch (ApiException e)
{
    Debug.Print("Exception when calling ConnectionLibraryApi.GetTemplateWithHttpInfo: " + e.Message);
    Debug.Print("Status Code: " + e.ErrorCode);
    Debug.Print(e.StackTrace);
}
```

#### Authorization

No authorization required

#### HTTP request headers

 - **Content-Type**: Not defined
 - **Accept**: text/plain

#### HTTP response details
| Status code | Description | Response headers |
|-------------|-------------|------------------|
| **200** | OK |  -  |
| **401** | Unauthorized |  -  |
| **404** | Not Found |  -  |
| **500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="propose"></a>
## **ProposeAsync**
> **List&lt;ConDesignItem&gt; ProposeAsync (Guid projectId, int connectionId, ConConnectionLibrarySearchParameters conConnectionLibrarySearchParameters = null)**

Proposes a list of design items for a specified connection within a project.

This method retrieves the connection model from the specified project and classifies its              typology. It then filters and proposes design items based on the connection's typology and design code.

### Parameters

| Name | Type | Description | Notes |
|------|------|-------------|-------|
| **projectId** | **Guid** | The unique identifier of the project containing the connection. |  |
| **connectionId** | **int** | The identifier of the connection for which design items are proposed. |  |
| **conConnectionLibrarySearchParameters** | **ConConnectionLibrarySearchParameters** | Parameters used to filter and refine the search for proposed connection design items, such as set membership and required connection features. | [optional]  |

### Return type

**List&lt;ConDesignItem&gt;**

### Example

Note: this example is autogenerated.

```csharp
using System;
using System.Collections.Generic;
using System.Diagnostics;
using IdeaStatiCa.ConnectionApi.Api;
using IdeaStatiCa.ConnectionApi.Client;
using IdeaStatiCa.ConnectionApi.Model;

namespace Example
{
    public class ProposeAsyncExample
    {
        public static async Task Main()
        {
            string ideaConFile = "testCon.ideaCon";

            string ideaStatiCaPath = "C:\\Program Files\\IDEA StatiCa\\StatiCa 26.0"; // Path to the IdeaStatiCa.ConnectionRestApi.exe

            using (var clientFactory = new ConnectionApiServiceRunner(ideaStatiCaPath))
            {
                using (var conClient = await clientFactory.CreateApiClient())
                {

                    // Open the project and get its id
                    var projData = await conClient.Project.OpenProjectAsync(ideaConFile);
                    Guid projectId = projData.ProjectId;

                    // (Required) Select parameters
                    connectionId = 56;  // int | The identifier of the connection for which design items are proposed.
                    var conConnectionLibrarySearchParameters = new ConConnectionLibrarySearchParameters(); // ConConnectionLibrarySearchParameters | Parameters used to filter and refine the search for proposed connection design items, such as set membership and required connection features. (optional)

                    try
                    {
                        // Proposes a list of design items for a specified connection within a project.
                        List<ConDesignItem> result = await conClient.ConnectionLibrary.ProposeAsync(projectId, connectionId, conConnectionLibrarySearchParameters);
                        Debug.WriteLine(result);
                    }
                    catch (ApiException  e)
                    {
                        Console.WriteLine("Exception when calling ConnectionLibrary.ProposeAsync: " + e.Message);
                        Console.WriteLine("Status Code: " + e.ErrorCode);
                        Console.WriteLine(e.StackTrace);
                    }
                    finally
                    {
                        await conClient.Project.CloseProjectAsync(projectId);
                    }
                }
            }
        }
    }
}
```

### Code Samples

[!code-csharp]

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **POST** /api/5/projects/{projectId}/connections/{connectionId}/propose

#### Using the ProposeWithHttpInfo variant
This returns an ApiResponse object which contains the response data, status code and headers.

```csharp
try
{
    // Proposes a list of design items for a specified connection within a project.
    ApiResponse<List<ConDesignItem>> response = conClient.ConnectionLibrary.ProposeWithHttpInfo(projectId, connectionId, conConnectionLibrarySearchParameters);
    Debug.Write("Status Code: " + response.StatusCode);
    Debug.Write("Response Headers: " + response.Headers);
    Debug.Write("Response Body: " + response.Data);
}
catch (ApiException e)
{
    Debug.Print("Exception when calling ConnectionLibraryApi.ProposeWithHttpInfo: " + e.Message);
    Debug.Print("Status Code: " + e.ErrorCode);
    Debug.Print(e.StackTrace);
}
```

#### Authorization

No authorization required

#### HTTP request headers

 - **Content-Type**: application/json
 - **Accept**: application/json

#### HTTP response details
| Status code | Description | Response headers |
|-------------|-------------|------------------|
| **200** | OK |  -  |
| **401** | Unauthorized |  -  |
| **404** | Not Found |  -  |
| **422** | Unprocessable Content |  -  |
| **500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="publishconnection"></a>
## **PublishConnectionAsync**
> **bool PublishConnectionAsync (Guid projectId, int connectionId, ConTemplatePublishParam conTemplatePublishParam = null)**

Publish template to Private or Company set.

### Parameters

| Name | Type | Description | Notes |
|------|------|-------------|-------|
| **projectId** | **Guid** | The unique identifier of the opened project in the ConnectionRestApi service. |  |
| **connectionId** | **int** | The ID of the connection whose template will be published. |  |
| **conTemplatePublishParam** | **ConTemplatePublishParam** | Parameters describing the publish operation (name, author, design set type). | [optional]  |

### Return type

**bool**

### Example

Note: this example is autogenerated.

```csharp
using System;
using System.Collections.Generic;
using System.Diagnostics;
using IdeaStatiCa.ConnectionApi.Api;
using IdeaStatiCa.ConnectionApi.Client;
using IdeaStatiCa.ConnectionApi.Model;

namespace Example
{
    public class PublishConnectionAsyncExample
    {
        public static async Task Main()
        {
            string ideaConFile = "testCon.ideaCon";

            string ideaStatiCaPath = "C:\\Program Files\\IDEA StatiCa\\StatiCa 26.0"; // Path to the IdeaStatiCa.ConnectionRestApi.exe

            using (var clientFactory = new ConnectionApiServiceRunner(ideaStatiCaPath))
            {
                using (var conClient = await clientFactory.CreateApiClient())
                {

                    // Open the project and get its id
                    var projData = await conClient.Project.OpenProjectAsync(ideaConFile);
                    Guid projectId = projData.ProjectId;

                    // (Required) Select parameters
                    connectionId = 56;  // int | The ID of the connection whose template will be published.
                    var conTemplatePublishParam = new ConTemplatePublishParam(); // ConTemplatePublishParam | Parameters describing the publish operation (name, author, design set type). (optional)

                    try
                    {
                        // Publish template to Private or Company set.
                        bool result = await conClient.ConnectionLibrary.PublishConnectionAsync(projectId, connectionId, conTemplatePublishParam);
                        Debug.WriteLine(result);
                    }
                    catch (ApiException  e)
                    {
                        Console.WriteLine("Exception when calling ConnectionLibrary.PublishConnectionAsync: " + e.Message);
                        Console.WriteLine("Status Code: " + e.ErrorCode);
                        Console.WriteLine(e.StackTrace);
                    }
                    finally
                    {
                        await conClient.Project.CloseProjectAsync(projectId);
                    }
                }
            }
        }
    }
}
```

### Code Samples

[!code-csharp]

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **POST** /api/5/projects/{projectId}/connections/{connectionId}/publish

#### Using the PublishConnectionWithHttpInfo variant
This returns an ApiResponse object which contains the response data, status code and headers.

```csharp
try
{
    // Publish template to Private or Company set.
    ApiResponse<bool> response = conClient.ConnectionLibrary.PublishConnectionWithHttpInfo(projectId, connectionId, conTemplatePublishParam);
    Debug.Write("Status Code: " + response.StatusCode);
    Debug.Write("Response Headers: " + response.Headers);
    Debug.Write("Response Body: " + response.Data);
}
catch (ApiException e)
{
    Debug.Print("Exception when calling ConnectionLibraryApi.PublishConnectionWithHttpInfo: " + e.Message);
    Debug.Print("Status Code: " + e.ErrorCode);
    Debug.Print(e.StackTrace);
}
```

#### Authorization

No authorization required

#### HTTP request headers

 - **Content-Type**: application/json
 - **Accept**: application/json

#### HTTP response details
| Status code | Description | Response headers |
|-------------|-------------|------------------|
| **200** | OK |  -  |
| **401** | Unauthorized |  -  |
| **404** | Not Found |  -  |
| **422** | Unprocessable Content |  -  |
| **500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)